public/programming/programming.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../index.html">Giovanni's Diary</a> &gt;
</p>

<div id="outline-container-org49fa481" class="outline-2">
<h2 id="org49fa481">Programming</h2>
<div class="outline-text-2" id="text-org49fa481">
<p>
Computer science is my main area of expertise. I am particularly
interested in <b>UNIX operating systems</b> and I am a strong supporter of
<a href="free-as-in-freedom.html">the free software movement</a>. I have worked on many projects, you can
find my code on my <a href="https://github.com/San7o/">github</a> profile; I maintain a list of my <a href="repositories.html">public
repositories</a> so you can get a tour of what I have been working on.
</p>

<p>
I am currently developing an <b>eBPF + kubernetes</b> application to log
file accesses in a <a href="./kubernetes/kubernetes.html">kubernetes</a> cluster.
</p>

<p>
I do all my reading, writing and coding in <a href="emacs/emacs.html">emacs</a> on <a href="./linux/linux.html">Linux</a>, currently
on Fedora but I am a big <a href="linux/linux-from-scratch.html">Linux From Scratch</a> user. Here is my current
<a href="setup.html">setup</a>.
</p>

<p>
Get notified on my programming diary via RSS <a href="../feeds/feedProgramming.rss">here</a>.
</p>

<ul class="org-ul">
<li><a href="notes/notes.html">Public Notes</a></li>
<li><a href="contributing-to-openstreetmap.html">Contributing to Openstreetmap</a></li>
<li><a href="root-a-samsung-galaxy-j5.html">Root a Samsung Galaxy j5</a></li>
<li><a href="offline-programming.html">Offline Programming</a></li>
<li><a href="cv.html">CV</a></li>
</ul>
</div>

<div id="outline-container-org7dd6391" class="outline-4">
<h4 id="org7dd6391">Wishlist</h4>
<div class="outline-text-4" id="text-org7dd6391">
<p>
Check out future <a href="wishlist.html">projects</a> I have in mind.
</p>

<hr />

<p>
Travel: <a href="../index.html">Giovanni's Diary</a>, <a href="../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
